# coding=utf-8


########## 创建字典 ##########

# 创建方式1：使用{}
dict1 = {}  # 创建一个空字典
dict1 = {"name": "miao", "age": 20}  # 创建一个非空字典

# 创建方式2：使用关键字dict
dict2 = dict(name="miao", age=20)  # 通过dict函数 创建字典
stu = [("name", "miao"), ("age", 20)]
dict3 = dict(stu)  # 使用dict函数 可以将序列 转为 字典

########## 添加修改字典的值 ##########
student = {"小萌": "1001", "小智": "1002", "小强": "1003"}

# 更新数据
student["小强"] = 1005  # {'小萌': '1001', '小智': '1002', '小强': 1005}

# 新增数据
student["小张"] = 1006  # {'小萌': '1001', '小智': '1002', '小强': 1005, '小张': 1006}

# 删除字典数据
student2 = {'小萌': '1001', '小智': '1002', '小强': 1005, '小张': 1006}

# 删除键值对(根据键 删除),原字典中键值会被删除
del student2["小张"]  # {'小萌': '1001', '小智': '1002', '小强': 1005}

# 删除整个字典, 删除后不可访问
del student2
# print(student2) # NameError: name 'student2' is not defined
